psuiappserver/UtilizationDRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Header/><SOAP-ENV:Body><nmwg:message xmlns="http://ggf.org/ns/nmwg/tools/org/perfsonar/1.0/" xmlns:discards="http://ggf.org/ns/nmwg/characteristic/discards/2.0/" xmlns:errors="http://ggf.org/ns/nmwg/characteristic/errors/2.0/" xmlns:netutil="http://ggf.org/ns/nmwg/characteristic/utilization/2.0/" xmlns:nmtm="http://ggf.org/ns/nmwg/time/2.0/" xmlns:nmwg="http://ggf.org/ns/nmwg/base/2.0/" xmlns:nmwgt="http://ggf.org/ns/nmwg/topology/2.0/" xmlns:perfsonar="http://ggf.org/ns/nmwg/tools/org/perfsonar/1.0/" xmlns:select="http://ggf.org/ns/nmwg/ops/select/2.0/" xmlns:snmp="http://ggf.org/ns/nmwg/characteristic/snmp/2.0/" type="SetupDataRequest"><nmwg:metadata id="metadata1"><netutil:subject id="subject1"><nmwgt:interface><nmwgt:ifName>ge-0/0/0.130</nmwgt:ifName><nmwgt:hostName/><nmwgt:direction>out</nmwgt:direction></nmwgt:interface></netutil:subject><nmwg:eventType>http://ggf.org/ns/nmwg/characteristic/utilization/2.0</nmwg:eventType></nmwg:metadata><nmwg:metadata id="metadata1-2"><select:subject id="subject1-2" metadataIdRef="metadata1"/><nmwg:eventType>http://ggf.org/ns/nmwg/ops/select/2.0</nmwg:eventType><select:parameters id="param1-2"><nmwg:parameter name="startTime">1403690400</nmwg:parameter><nmwg:parameter name="endTime">1403693999</nmwg:parameter><nmwg:parameter name="consolidationFunction">AVERAGE</nmwg:parameter><nmwg:parameter name="resolution">300</nmwg:parameter></select:parameters></nmwg:metadata><nmwg:data id="data1" metadataIdRef="metadata1-2"/></nmwg:message></SOAP-ENV:Body></SOAP-ENV:Envelope>